Catalogs/скт_Методы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>скт_Методы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.скт_Источники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскиеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДляВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.скт_СпособыДоставкиРезультата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.скт_ВариантыФорматовВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аргументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конвертация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.скт_ПроизвольныеАлгоритмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подготовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Алгоритм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.скт_ПроизвольныеАлгоритмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/скт_ВариантыФорматовВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>скт_ВариантыФорматовВыгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ANSITXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DOCX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MXL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MXL7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ODS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLSX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/скт_СпособыДоставкиРезультата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>скт_СпособыДоставкиРезультата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Непосредственно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВКаталог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/скт_Источники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>скт_Источники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/скт_Методы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция НовыеАргументыВызоваМетода(МетодСсылка) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Формат", 			МетодСсылка.Формат);
	Результат.Вставить("Архивировать", 		МетодСсылка.Архивировать);
	Результат.Вставить("СпособДоставки", 	МетодСсылка.СпособДоставки);
	Результат.Вставить("ПутьДляВыгрузки", 	МетодСсылка.ПутьДляВыгрузки);
	Возврат Результат;

КонецФункции // НовыеАргументыВызоваМетода()

Процедура Вызвать(Метод, ПотокПриемник, Знач ВходныеПараметры = Неопределено, выхРасширениеФайла = Неопределено) Экспорт 

	Если ВходныеПараметры = Неопределено Тогда
		ВходныеПараметры = Новый Структура;
	КонецЕсли;
	Аргументы = НовыеАргументыВызоваМетода(Метод);
	Если ВходныеПараметры.Свойство("Формат") Тогда 
		Формат = Перечисления.скт_ВариантыФорматовВыгрузки.ПоИмени(ВходныеПараметры.Формат);
		Если Формат <> Неопределено Тогда
			Аргументы.Формат = Формат;
		КонецЕсли;
		ВходныеПараметры.Удалить("Формат");
	КонецЕсли;
	Если ВходныеПараметры.Свойство("Архивировать") Тогда
		Аргументы.Архивировать = НРег(ВходныеПараметры.Архивировать) = "true" Или ВходныеПараметры.Архивировать = "1";
		ВходныеПараметры.Удалить("Архивировать");
	КонецЕсли;
	Если ВходныеПараметры.Свойство("СпособДоставки") Тогда
		Аргументы.СпособДоставки = ?(ВходныеПараметры.СпособДоставки = "1", Перечисления.скт_СпособыДоставкиРезультата.ВыгрузкаВКаталог, Перечисления.скт_СпособыДоставкиРезультата.Непосредственно);
		ВходныеПараметры.Удалить("СпособДоставки");
	КонецЕсли;
	Если ВходныеПараметры.Свойство("ПутьДляВыгрузки") Тогда
		Аргументы.ПутьДляВыгрузки = ВходныеПараметры.ПутьДляВыгрузки;
		ВходныеПараметры.Удалить("ПутьДляВыгрузки");
	КонецЕсли;
	
	Для Каждого текПараметр Из ВходныеПараметры Цикл
		Если текПараметр.Значение <> Неопределено Тогда
			Аргументы.Вставить(текПараметр.Ключ, текПараметр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ИмяМетода = Метод.Код;
	Если Аргументы.Архивировать Тогда
		РасширениеФайла = "zip";
	Иначе
		РасширениеФайла = Перечисления.скт_ВариантыФорматовВыгрузки.РасширениеФайлаДляСохранения(Аргументы.Формат);
	КонецЕсли;
	
	РезультатКомпоновки = ПолучитьРезультатКомпоновки(Метод, Аргументы);
	
	Если Аргументы.СпособДоставки = Перечисления.скт_СпособыДоставкиРезультата.Непосредственно Тогда
		ВывестиРезультатВыполненияПоФормату(РезультатКомпоновки, ИмяМетода, Аргументы.Формат, ПотокПриемник, Аргументы.Архивировать);
		выхРасширениеФайла = РасширениеФайла;
	Иначе
		ПутьДляВыгрузки = Метод.ПутьДляВыгрузки;
		ИмяФайлаВыгрузки = ИмяМетода;
		ФайлВыгрузки = Новый Файл(ПутьДляВыгрузки + ИмяФайлаВыгрузки + "." + РасширениеФайла);
		Поток = Новый ФайловыйПоток(ФайлВыгрузки.ПолноеИмя
		, РежимОткрытияФайла.Создать, ДоступКФайлу.Запись);
		ВывестиРезультатВыполненияПоФормату(РезультатКомпоновки, ИмяМетода, Аргументы.Формат, Поток, Аргументы.Архивировать);
		
		Запись = Новый ЗаписьТекста(ПотокПриемник, КодировкаТекста.UTF8, Символы.ПС, Символы.ПС, Ложь);
		Запись.ЗаписатьСтроку(СтрШаблон("Результат записан в файл: %1", СокрЛП(ФайлВыгрузки.ПолноеИмя)));
		Запись.Закрыть();
		выхРасширениеФайла = "txt";
	КонецЕсли;
	
КонецПроцедуры // Вызвать()

Функция ПолучитьРезультатКомпоновки(Метод, ВходныеПараметры = Неопределено) Экспорт

	Если ВходныеПараметры = Неопределено Тогда
		ВходныеПараметры = Новый Структура;
	КонецЕсли;
	
	АргументыМетода = Метод.Аргументы;
	ОбязательныеАргументы = АргументыМетода.НайтиСтроки(Новый Структура("Обязательный", Истина));
	Для Каждого текАргумент Из ОбязательныеАргументы Цикл
		Если Не ВходныеПараметры.Свойство(текАргумент.Имя) Тогда
			ВызватьИсключение СтрШаблон("В метод ""%1"" не передан обязательный аргумент ""%2""", Метод.Код, текАргумент.Имя);
		КонецЕсли;             
	КонецЦикла;
	
	Источник = Метод.Источник; 
	Схема = Источник.Схема.Получить();
	Компоновщик = Справочники.скт_Источники.КомпоновщикНастроек(Источник, Метод.ПользовательскиеНастройки.Получить());
	
	ТаблицаАргументов = АргументыМетода.Выгрузить();
	ТаблицаАргументов.Колонки.Добавить("Значение", Новый ОписаниеТипов);
	
	Для Каждого текАргумент Из ТаблицаАргументов Цикл
		
		Если Не ВходныеПараметры.Свойство(текАргумент.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если текАргумент.Конвертация.Пустая() Тогда
			текАргумент.Значение = ВходныеПараметры[текАргумент.Имя];
		Иначе
			Алгоритм = скт_ПроизвольныеАлгоритмыСервер.ОбъектВнешнейОбработки(текАргумент.Конвертация);
			текАргумент.Значение = Алгоритм.ПолучитьРезультат(ВходныеПараметры[текАргумент.Имя], Метод, Схема, Компоновщик);
		КонецЕсли;
		
		ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных(текАргумент.Имя);
		СтрокаПараметра = Компоновщик.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
		Если СтрокаПараметра <> Неопределено Тогда
			Компоновщик.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрКомпоновки, текАргумент.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	ВнешниеНаборыДанных = Неопределено;
	
	Для Каждого текАлгоритм Из Метод.Подготовка.НайтиСтроки(Новый Структура("Активность", Истина)) Цикл
		Алгоритм = скт_ПроизвольныеАлгоритмыСервер.ОбъектВнешнейОбработки(текАлгоритм.Алгоритм);
		Алгоритм.ВыполнитьПодготовкуМетода(Метод, Схема, Компоновщик, ТаблицаАргументов, ВходныеПараметры, ВнешниеНаборыДанных);
	КонецЦикла;
	
	Приемник = Новый ТабличныйДокумент;
	Если ВходныеПараметры.Формат = Перечисления.скт_ВариантыФорматовВыгрузки.CSV 
		Или ВходныеПараметры.Формат = Перечисления.скт_ВариантыФорматовВыгрузки.JSON
		Или ВходныеПараметры.Формат = Перечисления.скт_ВариантыФорматовВыгрузки.XML Тогда
		Приемник = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Возврат Справочники.скт_Источники.Скомпоновать(Источник
		, Компоновщик.ПолучитьНастройки(), Приемник, ВнешниеНаборыДанных);

КонецФункции // ПолучитьРезультат()

#КонецОбласти

#Область СлужебныеФункции

Процедура ВывестиРезультатВыполненияПоФормату(РезультатВыполнения, ИмяМетода, Формат, Поток, Архивировать)
	
	Если Архивировать Тогда
		ВременныйФайл = СтрШаблон("%1%2.%3", КаталогВременныхФайлов(), ИмяМетода, Перечисления.скт_ВариантыФорматовВыгрузки.РасширениеФайлаДляСохранения(Формат));
		ВремПоток = Новый ФайловыйПоток(ВременныйФайл
		, РежимОткрытияФайла.Создать, ДоступКФайлу.Запись);
		ВывестиРезультатВыполненияПоФормату(РезультатВыполнения, ИмяМетода, Формат, ВремПоток, Ложь);
		ВремПоток.Закрыть();
		
		Зип = Новый ЗаписьZipФайла(Поток,,,МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный,, КодировкаИменФайловВZipФайле.UTF8);
		Зип.Добавить(ВременныйФайл, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		Зип.Записать();
		УдалитьФайлы(ВременныйФайл);
	Иначе
		Если Формат = Перечисления.скт_ВариантыФорматовВыгрузки.CSV Тогда
			скт_ОбщегоНазначенияСервер.CSVПоТаблицеЗначений(РезультатВыполнения, Поток);
		ИначеЕсли Формат = Перечисления.скт_ВариантыФорматовВыгрузки.JSON Тогда
			скт_ОбщегоНазначенияСервер.JSONПоТаблицеЗначений(РезультатВыполнения, Поток);
		ИначеЕсли Формат = Перечисления.скт_ВариантыФорматовВыгрузки.XML Тогда
			скт_ОбщегоНазначенияСервер.XMLПоТаблицеЗначений(РезультатВыполнения, Поток);
		Иначе
			скт_ОбщегоНазначенияСервер.ДвоичныеДанныеТабличногоДокумента(РезультатВыполнения, ТипФайлаТабличногоДокумента[XMLСтрока(Формат)], Поток);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
